app/controllers/posts_controller.rb

  def index
    @posts = Post.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts`

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `desciption`, `title`, `updated_at`) VALUES ('2013-01-29 10:01:49', 'Let check how many comments I will get for my first post', 'First Post', '2013-01-29 10:01:49')

  def create_comment
    @post = Post.find(params[:id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `created_at`, `post_id`, `updated_at`) VALUES ('test', '2013-01-29 10:23:37', 1, '2013-01-29 10:23:37')